cf_billing/Documents/бестРегистрацияПоказанийНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестРегистрацияПоказанийНП</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бестМаксимальныеПоказанияНП</xr:Item>
				<xr:Item>AccumulationRegister.бестОбъемНачисленийНП</xr:Item>
				<xr:Item>InformationRegister.бестПоказанияПриборовУчетаНП</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПоказаний</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргИсточникиПоказаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестЗагруженныеДанныеИзВнешнихИсточников</v8:Type>
						<v8:Type>cfg:DocumentRef.бестЗагрузкаПоказанийИзВнешнихИсточников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоказанияПриборовУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоследнихПоказаний</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентПУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноВозможныеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноВозможныйОбъемПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Переворот</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереворотИзмененПользователем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредыдущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеПоказаний</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргСостояниеПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднийОбъемПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусИзмененПользователем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяЗона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднийОбъемПотребления3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтклонения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргПричиныОтклоненияПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопустимыйОбъемОтклонений</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходЗаПредМесяц</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходЗаАналогичныйПериодПредГода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемПочасовойВедомости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтрокиТочкиУчета</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТочкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьВидДифференцированности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыДифференцированности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDТочкиУчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШкалыПриборовУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтрокиТочкиУчета</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДифференцированности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыДифференцированности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шкала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Enums/энргСостояниеПоказаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСостояниеПоказаний</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приняты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонены</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Documents/бестРегистрацияПоказанийНП/Forms/ФормаДокументаРегистрацияКонтрольногоСъема/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если ЗначениеЗаполнено(Объект.Организация) И Не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
		Объект.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
	КонецЕсли;
	
	ЗаполнитьДокумент  = Ложь;
	Если Параметры.Свойство("ЗаполнитьДокумент") тогда
		ЗаполнитьДокумент = Параметры.ЗаполнитьДокумент;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ОбъектРасчета) И ЗаполнитьДокумент тогда
		ЗаполнитьДанныеДоговораСервер();		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
		Объект.ИсточникПоказаний = Справочники.энргИсточникиПоказаний.КонтрольныйСъем;
	КонецЕсли;
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	бестРаботаСФормойДоговораНезависимыйСбыт.УстановитьСвойстваЭлементаРегион(ЭтотОбъект);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДоговорФилиал", "Видимость", Не бестРаботаСНезависимымСбытом.ПолучитьУчетНезависимыйСбыт());
	
	бестЛокализацияСервер.ПриСозданииНаСервере_бестРегистрацияПоказанийНП(ЭтотОбъект, Объект.Ссылка);
	ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка);   
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения	
	
	энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	энргШкалыТарифныеЗоныСервер.ЗаполнитьОбъектПоПредставлениюФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	бестРаботаСПоследовательностямиНП.ВосстановитьПоследовательностьПоНП(Объект.Организация, Объект.ПериодНачисления,Объект.Район,Объект.Договор);
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	бестЛокализацияСервер.ПослеЗаписиНаСервере_бестРегистрацияПоказанийНП(ЭтотОбъект, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Элементы.Контроллер.Видимость = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргРегистрацияПоказанийАбонента_РегистрацияКонтрольногоСъема");
	ЗаполнитьАдрессОбъекта();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда 		
		Объект.ПериодНачисления = энргРаботаСПериодомДействия.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация);		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	Объект.Организация = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Район, "Организация");
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзменении(Элемент)
	ЗаполнитьДанныеОбъектаРасчетаСервер();
	ЗаполнитьАдрессОбъекта();
	
	ОбъектРасчетаПриИзмененииПереопределяемый(Элемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТочкиУчета

&НаКлиенте
Процедура ТочкиУчетаПриАктивизацииСтроки(Элемент)
	
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ИмяТаблицыШкал							= "ШкалыПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыШкал	 					= Элементы[ИмяТаблицыШкал];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкал,"IDСтрокиТочкиУчета",ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }

	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтрокиШкалы); 
	// энргРаботаСВидомДифференцированности }

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаОбъектРасчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	бестПользовательскийВводКлиент.НачалоВыбораОбъекта(Элемент, Объект.Дата, Объект.Организация, Объект.Район, Объект.Договор, СтандартнаяОбработка, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаТочкаУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	//энргПользовательскийВводКлиент.НачалоВыбораТочкиУчета(Элемент, Объект.Дата, Объект.Район, Объект.Договор, СтандартнаяОбработка, ТекущиеДанные.ОбъектРасчета);
	
	СтандартнаяОбработка 	= Ложь;
	
	
	ВыборУслугиИТочкиУчета(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаВидДифференцированностиПриИзменении(Элемент)
	
	ТекДанные 								= Элементы.ТочкиУчетаЕстьШкалыЕстьТарифныеЗоны.ТекущиеДанные;
	ВидДифференцированности 				= ТекДанные.ВидДифференцированности;
	СоставКаналов = энргРаботаСТочкамиУчетаСервер.СоставВидаДифференцированности(ВидДифференцированности);
	энргРаботаСТочкамиУчетаКлиент.ПриИзмененииВидаДифференцированности(ЭтаФорма,ТекДанные,СоставКаналов,"ПоказанияПриборовУчета",Неопределено); 
	
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаТочкаУчетаПриИзменении(Элемент)
		
	ТекДанные = Элементы.ТочкиУчетаЕстьШкалыЕстьТарифныеЗоны.ТекущиеДанные;
	
//    ЗаполнитьПриборУчетСервер(ТекДанные);

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПередУдалением(Элемент, Отказ)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	
	ТаблицыФормы				= Новый Массив;	
	ТаблицыФормы.Добавить("ШкалыПриборовУчета");
	
	ТаблицыФормыВторогоУровня	= Новый Массив;
	ТаблицыФормыВторогоУровня.Добавить("ПоказанияПриборовУчета");
	
	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы, "ТочкиУчета", ТаблицыФормыВторогоУровня);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыШкалыПриборовУчета

&НаКлиенте
Процедура ШкалыПриборовУчетаПриАктивизацииСтроки(Элемент)
	ИмяТаблицыШкал	 						= "ШкалыПриборовУчета" + ПрефиксТочекУчета;
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыШкал].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПоказанияПриборовУчета

&НаКлиенте
Процедура ПоказанияПриборовУчетаТекущиеПоказанияПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета();
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаПереворотПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета(Новый Структура("ПереворотИзмененПользователем",истина));	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаСостояниеПоказанийПриИзменении(Элемент)
	ПересчитатьСтрокуПриборовУчета(Новый Структура("СтатусИзмененПользователем",истина));	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДанныеОбъектаРасчетаСервер()
	
	Объект.ПоказанияПриборовУчета.Очистить();
	Объект.ТочкиУчета.Очистить();
	Объект.ШкалыПриборовУчета.Очистить();
	
	Если Не ЗначениеЗаполнено(Объект.ОбъектРасчета) Тогда
		Возврат;	
	КонецЕсли;
	
	Результат 									= бестРаботаСприборамиУчетаСервер.ДействующиеПриборыУчетаПоОбъектуРасчета(Объект.Дата,Объект.Организация,Объект.Район,Объект.ОбъектРасчета); 
	Выборка  									= Результат.выбрать();
	ТекТочкаУчета 								= Неопределено;
	ТекПрибор 									= Неопределено;
	ТекШкала 									= Неопределено;
	IDСтрокиТочки 								= Неопределено;
	IDСтрокиШкалы 								= Неопределено;
	Пока Выборка.следующий() цикл
		Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Или Не ТекПрибор = Выборка.ПриборУчета Тогда
			СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();
			IDСтрокиТочки 						= Новый УникальныйИдентификатор;
			ЗаполнитьЗначенияСвойств(СтрокаТочкиУчета, Выборка);
			СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;			
		КонецЕсли;
		
		Если НЕ ТекШкала = Выборка.Шкала ИЛИ ТекТочкаУчета <> Выборка.ТочкаУчета Тогда
			СтрокаШкалы  						= Объект.ШкалыПриборовУчета.Добавить();
			IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
			СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
			СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
			СтрокаШкалы.Шкала 					= Выборка.Шкала;
			СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
		КонецЕсли;

		СтрокаПоказаний 						= Объект.ПоказанияПриборовУчета.Добавить();
		СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
		СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона;
		
		ТекТочкаУчета 							= Выборка.ТочкаУчета;
		ТекПрибор 								= Выборка.ПриборУчета;
		ТекШкала 								= Выборка.Шкала;
	КонецЦикла;
	

	бестРаботаСПоказаниямиПриборовУчетаНПСервер.ОбновитьТЧПоказанияПрибораУчета(Объект.ТочкиУчета,Объект.ШкалыПриборовУчета,Объект.ПоказанияПриборовУчета,Объект.Дата,Объект.Организация,Объект.Район,Ложь);
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект,Объект,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеДоговораСервер()
	
	Объект.ПоказанияПриборовУчета.Очистить();
	Объект.ТочкиУчета.Очистить();
	Объект.ШкалыПриборовУчета.Очистить();
	
	Результат 									= бестРаботаСприборамиУчетаСервер.ДействующиеПриборыУчетаПоОбъектуРасчета(Объект.Дата,Объект.Организация,Объект.Район,Объект.Договор); 
	Выборка  									= Результат.выбрать();
	ТекТочкаУчета 								= Неопределено;
	ТекПрибор 									= Неопределено;
	IDСтрокиТочки 								= Неопределено;
	IDСтрокиШкалы 								= Неопределено;
	Пока Выборка.следующий() цикл
		Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Или Не ТекПрибор = Выборка.ПриборУчета Тогда
			СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();
			IDСтрокиТочки 						= Новый УникальныйИдентификатор;
			ЗаполнитьЗначенияСвойств(СтрокаТочкиУчета, Выборка);
			СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;			
		КонецЕсли;
		
		//Если НЕ ТекШкала = Выборка.Шкала Тогда
			СтрокаШкалы  						= Объект.ШкалыПриборовУчета.Добавить();
			IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
			СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
			СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
			СтрокаШкалы.Шкала 					= Выборка.Шкала;
			СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
		//КонецЕсли;

		СтрокаПоказаний 						= Объект.ПоказанияПриборовУчета.Добавить();
		СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
		СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона;
		
		ТекТочкаУчета 							= Выборка.ТочкаУчета;
		ТекПрибор 								= Выборка.ПриборУчета
	КонецЦикла;
	

	бестРаботаСПоказаниямиПриборовУчетаНПСервер.ОбновитьТЧПоказанияПрибораУчета(Объект.ТочкиУчета,Объект.ШкалыПриборовУчета,Объект.ПоказанияПриборовУчета,Объект.Дата,Объект.Организация,Объект.Район,Ложь);
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект,Объект,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтрокуПриборовУчета(ДанныеСтроки  = Неопределено)
	
	Если ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
		текСтрока 								= Элементы.ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоны.ТекущиеДанные;
	ИначеЕсли НЕ ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
		текСтрока 								= Элементы.ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон.ТекущиеДанные;
	ИначеЕсли ИспользоватьТарифныеЗоны И НЕ ИспользоватьШкалыПриборовУчета Тогда
		текСтрока 								= Элементы.ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоны.ТекущиеДанные;
	Иначе	
		текСтрока 								= Элементы.ТочкиУчетаНетШкалНетТарифныхЗон.ТекущиеДанные;
	КонецЕсли;
	
	Если текСтрока = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Если ДанныеСтроки <>Неопределено тогда
		ЗаполнитьЗначенияСвойств(текСтрока,ДанныеСтроки);
	КонецЕсли;
	
	бестРаботаСПоказаниямиПриборовУчетаНПКлиентСервер.ПересчитатьСтрокуПриборовУчета(текСтрока,Объект.Дата,Ложь);	
	
	Если текСтрока.СостояниеПоказаний 	= ПредопределенноеЗначение("Перечисление.энргСостояниеПоказаний.Отклонены") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Показания отклонены"); 		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборУслугиИТочкиУчета(ТекДанные)
	СтруктураОтбора = Новый Структура("Период,Организация,Район,Договор,ОбъектРасчета,ТочкаУчета,Услуга,IDСтроки,ПриборУчета",Объект.Дата);
	ЗаполнитьЗначенияСвойств(СтруктураОтбора,Объект);
	ЗаполнитьЗначенияСвойств(СтруктураОтбора,ТекДанные);
	
	ПараметрыВыбораФормы	= Новый Структура("СтруктураОтбора", СтруктураОтбора);
	ОписаниеОповещения 		= Новый ОписаниеОповещения("ТочкаУчетаОкончаниеВыбора",ЭтаФорма,Новый Структура("СтруктураОтбора, ТекДанные", СтруктураОтбора, ТекДанные));
	
	ОткрытьФорму("ОбщаяФорма.бестФормаВыбораТочкиУчета",ПараметрыВыбораФормы,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура ТочкаУчетаОкончаниеВыбора(РезультатЗакрытия,ДополнительныеПараметры) Экспорт  
	
	Если РезультатЗакрытия <> Неопределено Тогда 
		ТекДанные		= ДополнительныеПараметры.ТекДанные;
		СтруктураОтбора	= ДополнительныеПараметры.СтруктураОтбора;
		СтруктураОтбора.ТочкаУчета		= РезультатЗакрытия.ТочкаУчета;
		СтруктураОтбора.Услуга			= РезультатЗакрытия.Услуга;
		
		ТочкаУчетаОкончаниеВыбораНаСервере(СтруктураОтбора);
		ЗаполнитьЗначенияСвойств(ТекДанные, СтруктураОтбора);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ТочкаУчетаОкончаниеВыбораНаСервере(СтруктураОтбора)  
	
	Результат 								= энргРаботаСприборамиУчетаСервер.ДействующиеПриборыУчетаТочкиУчетаЮрЛиц(СтруктураОтбора.Период,СтруктураОтбора.Организация,СтруктураОтбора.Район,СтруктураОтбора.Договор, СтруктураОтбора.ОбъектРасчета, СтруктураОтбора.ТочкаУчета); 
	Выборка  								= Результат.выбрать();
	Если Выборка.следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураОтбора, Выборка); 		 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАдрессОбъекта()
	Если ЗначениеЗаполнено(Объект.ОбъектРасчета) Тогда
		АдресОбъекта = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОбъектРасчета, "Строение");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервереПереопределяемый(Отказ, СтандартнаяОбработка)
	// Переопределяется в расширении	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектРасчетаПриИзмененииПереопределяемый(Элемент)
	// Переопределяется в расширении
КонецПроцедуры

#КонецОбласти
